* Work Log
* 8086 Decoder/Simulator
** Decoder
*** Implemented
+ =MOV=: Reg to reg, immediate to register, rer/memory to reg/memory, segment:register mov
+ =ADD=
+ =SUB=
+ =JMPS/LOOPS=
*** NOT Implemented
** Simulator
*** Implemented
*** NOT Implemented
* WIP
** TODO Add memory to simulator [/]
*** TODO Add memory immediate =mov= instruction
:LOGBOOK:
CLOCK: [2023-04-10 Mon 18:13]--[2023-04-10 Mon 18:50] =>  0:37
CLOCK: [2023-04-10 Mon 16:15]--[2023-04-10 Mon 18:13] =>  1:58
CLOCK: [2023-04-10 Mon 14:17]--[2023-04-10 Mon 16:09] =>  1:52
CLOCK: [2023-04-10 Mon 13:25]--[2023-04-10 Mon 14:09] =>  0:44
CLOCK: [2023-04-10 Mon 10:55]--[2023-04-10 Mon 13:23] =>  2:28
CLOCK: [2023-04-10 Mon 01:07]--[2023-04-10 Mon 03:14] =>  2:07
CLOCK: [2023-04-09 Sun 20:25]--[2023-04-09 Sun 22:01] =>  1:36
CLOCK: [2023-04-09 Sun 13:14]--[2023-04-09 Sun 13:38] =>  0:24
CLOCK: [2023-04-09 Sun 12:18]--[2023-04-09 Sun 13:04] =>  0:46
CLOCK: [2023-04-09 Sun 11:16]--[2023-04-09 Sun 11:58] =>  0:42
:END:

The function ~SimCommand~ which is supposed to take care of simulating a given command is doing work that we already have done previously in
other functions such as ~RegIMM_RegMem~. A better approach is probably to remove it an put all the functionality into the functions that
have already extracted the register and data. At the same time It would be best to split out the code inside those functions into code that
does the simulation and code that translated the binary instructions into assembly.
